# Data Wrangling

In [22]:
import pandas as pd
import numpy as np

In [2]:
dataframe = {
    'name': ['arthur', 'jackson', 'ana'],
    'age': [25, 46, 21],
    'driver': [True, True, False]
}

dataframe = pd.DataFrame(dataframe)
dataframe

      name  age  driver
0   arthur   25    True
1  jackson   46    True
2      ana   21   False

In [4]:
new_person = pd.DataFrame([['molly', 34, True]], columns=['name','age','driver'])
dataframe = pd.concat([dataframe, new_person], ignore_index=True)

dataframe

      name  age  driver
0   arthur   25    True
1  jackson   46    True
2      ana   21   False
3    molly   34    True

## Descrevendo os Dados

In [6]:
dataframe.shape

(4, 3)

In [7]:
dataframe.describe()

             age
count   4.000000
mean   31.500000
std    11.090537
min    21.000000
25%    24.000000
50%    29.500000
75%    37.000000
max    46.000000

In [13]:
print('Maximum:', dataframe['age'].max())
print('Minimum:', dataframe['age'].min())
print('Mean:', dataframe['age'].mean())
print('Sum:', dataframe['age'].sum())
print('Count:', dataframe['age'].count())

Maximum: 46
Minimum: 21
Mean: 31.5
Sum: 126
Count: 4

In [15]:
dataframe.count()

name      4
age       4
driver    4
dtype: int64

## Slice e Select

In [9]:
dataframe.iloc[0] # seleciona o que est√° no indice 0

name      arthur
age           25
driver      True
Name: 0, dtype: object

In [10]:
dataframe.iloc[0:2]

      name  age  driver
0   arthur   25    True
1  jackson   46    True

In [11]:
dataframe[dataframe['age'] > 25]

      name  age  driver
1  jackson   46    True
3    molly   34    True

In [16]:
dataframe.drop('driver', axis=1).head()

      name  age
0   arthur   25
1  jackson   46
2      ana   21
3    molly   34

## Groupby

In [21]:
dataframe.groupby('age')['name'].count()

age
21    1
25    1
34    1
46    1
Name: name, dtype: int64

In [23]:
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
dataframe = pd.DataFrame(index=time_index)

dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)
dataframe.resample('W').sum()

C:\Users\BeatrizAlmeida\AppData\Local\Temp\ipykernel_5624\626093716.py:1: FutureWarning: 'S' is deprecated and will be removed in a future version, please use 's' instead.
  time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

            Sale_Amount
2017-06-11        86613
2017-06-18       101034
2017-06-25       100876
2017-07-02       100769
2017-07-09       100577
2017-07-16        10336